aerror2/erfly6/Kinetis_KL/CMSIS/Device/Include/Kinetis_KLxx.h
/*****************************************************************************
 *                   SEGGER Microcontroller GmbH & Co. KG                    *
 *            Solutions for real time microcontroller applications           *
 *****************************************************************************
 *                                                                           *
 *               (c) 2017 SEGGER Microcontroller GmbH & Co. KG               *
 *                                                                           *
 *           Internet: www.segger.com   Support: support@segger.com          *
 *                                                                           *
 *****************************************************************************/

#ifndef __Kinetis_KLxx_h
#define __Kinetis_KLxx_h

#if defined(MKL02Z8xxx4) || defined(MKL02Z16xxx4) || defined(MKL02Z32xxx4)

#include "MKL02Z4.h"

#elif defined(MKL03Z8xxx4) || defined(MKL03Z16xxx4) || defined(MKL03Z32xxx4)

#include "MKL03Z4.h"

#elif defined(MKL04Z8xxx4) || defined(MKL04Z16xxx4) || defined(MKL04Z32xxx4)

#include "MKL04Z4.h"

#elif defined(MKL05Z8xxx4) || defined(MKL05Z16xxx4) || defined(MKL05Z32xxx4)

#include "MKL05Z4.h"

#elif defined(MKL13Z32xxx4) || defined(MKL13Z64xxx4)

#include "MKL13Z644.h"

#elif defined(MKL14Z32xxx4) || defined(MKL14Z64xxx4)

#include "MKL14Z4.h"

#elif defined(MKL15Z32xxx4) || defined(MKL15Z64xxx4) || defined(MKL15Z128xxx4)

#include "MKL15Z4.h"

#elif defined(MKL16Z32xxx4) || defined(MKL16Z64xxx4) || defined(MKL16Z128xxx4) || defined(MKL16Z256xxx4)

#include "MKL16Z4.h"

#elif defined(MKL17Z32xxx4) || defined(MKL17Z64xxx4)

#include "MKL17Z644.h"

#elif defined(MKL17Z128xxx4) || defined(MKL17Z256xxx4)

#include "MKL17Z4.h"

#elif defined(MKL24Z32xxx4) || defined(MKL24Z64xxx4)

#include "MKL24Z4.h"

#elif defined(MKL25Z32xxx4) || defined(MKL25Z64xxx4) || defined(MKL25Z128xxx4)

#include "MKL25Z4.h"

#elif defined(MKL26Z32xxx4) || defined(MKL26Z64xxx4) || defined(MKL26Z128xxx4) || defined(MKL26Z256xxx4)

#include "MKL26Z4.h"

#elif defined(MKL27Z32xxx4) || defined(MKL27Z64xxx4)

#include "MKL27Z644.h"

#elif defined(MKL27Z128xxx4) || defined(MKL27Z256xxx4)

#include "MKL27Z4.h"

#elif defined(MKL28Z512xxx7)

#include "MKL28Z7.h"

#elif defined(MKL33Z32xxx4) || defined(MKL33Z64xxx4)

#include "MKL33Z644.h"

#elif defined(MKL33Z128xxx4) || defined(MKL33Z256xxx4)

#include "MKL33Z4.h"

#elif defined(MKL34Z64xxx4)

#include "MKL34Z4.h"

#elif defined(MKL36Z64xxx4) || defined(MKL36Z128xxx4) || defined(MKL36Z256xxx4)

#include "MKL36Z4.h"

#elif defined(MKL43Z128xxx4) || defined(MKL43Z256xxx4)

#include "MKL43Z4.h"

#elif defined(MKL46Z128xxx4) || defined(MKL46Z256xxx4)

#include "MKL46Z4.h"

#elif defined(MKL82Z128xxx7)

#include "MKL82Z7.h"

#endif

#endif
